[
  {
    "module": "Interest Awareness",
    "steps": [
      {"type": "question", "text": "Ask your child, \"What are 2–3 things you love or like to do?\"\n\n<div style=\"margin-top: 12px; padding: 8px; background-color: #f3f4f6; border-left: 3px solid #3b82f6; border-radius: 4px;\"><em><strong>Tip:</strong> If you both struggle to think of things, think about what they do all the time without anybody asking them to.</em></div>"},
      {"type": "question", "text": "Ask your child, \"What is it about those 2-3 things that you like them so much?\"\n\n<div style=\"margin-top: 12px; padding: 8px; background-color: #f3f4f6; border-left: 3px solid #3b82f6; border-radius: 4px;\"><em><strong>Tip:</strong> This is trying to understand why children like what they like, but children tend to know the \"what about it\" rather than the \"why\" behind what they like.</em></div>"},
      {"type": "question", "text": "Ask your child, \"Do you have any new interests, hobbies, or likes?\"\n\n<div style=\"margin-top: 12px; padding: 8px; background-color: #f3f4f6; border-left: 3px solid #3b82f6; border-radius: 4px;\"><em><strong>Tip:</strong> If nothing comes up, ask them about something they'd like to try but haven't had a chance to try yet.</em></div>"},
      {"type": "question", "text": "Perfect! Now that we've explored your child's interests, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Great! Are you ready to see a summary of your child's interests? (Type 'yes' to continue)"}
    ]
  },
  {
    "module": "Can Do Attitude",
    "steps": [
      {"type": "question", "text": "What are 1-3 ways your child defines success?"},
      {"type": "question", "text": "What makes a space feel good for your child to focus or be creative in?"},
      {"type": "question", "text": "How can you tell when your child needs help?"},
      {"type": "question", "text": "What are some ways your child pushes through challenges in things they care about?"},
      {"type": "question", "text": "Perfect! Now that we've explored your child's can-do attitude, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Excellent! I'm summarizing your child's can-do attitude and resilience for teachers."}
    ]
  },
  {
    "module": "Multicultural Navigation",
    "steps": [
      {"type": "question", "text": "How is your child's behavior or personality different at home compared to school?"},
      {"type": "question", "text": "What does your child usually do when they're somewhere new or unfamiliar?"},
      {"type": "question", "text": "Perfect! Now that we've explored how your child navigates different cultures, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Wonderful! I'm creating a summary about how your child navigates different cultures and environments."}
    ]
  },
  {
    "module": "Selective Trust",
    "steps": [
      {"type": "question", "text": "What are 1-3 things you've taught your child to notice when deciding who to trust?"},
      {"type": "question", "text": "What are some ways a teacher or mentor can earn your child's trust?"},
      {"type": "question", "text": "Perfect! Now that we've explored how your child builds trust, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Great insights! I'm summarizing how your child builds trust and what teachers should know."}
    ]
  },
  {
    "module": "Social Justice / Fairness",
    "steps": [
      {"type": "question", "text": "Ask your child, 'How do they want to help their community?'"},
      {"type": "question", "text": "Ask your child, 'What do they want to do to make the world a better place?'"},
      {"type": "question", "text": "Perfect! Now that we've explored your child's sense of social justice, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Amazing! I'm creating a final comprehensive summary that puts everything together for teachers and others."}
    ]
  },
  {
    "module": "Racial Identity",
    "steps": [
      {"type": "question", "text": "What are 2 or 3 feelings your child has when they think about being Black? (Good or hard feelings are okay.)"},
      {"type": "question", "text": "Can you name 2 or 3 traditions or cultural things your child connects with being Black?"},
      {"type": "question", "text": "Who are 2 or 3 Black people your child looks up to or feels inspired by?"},
      {"type": "question", "text": "Perfect! Now that we've explored your child's racial identity, are you ready to see a summary of what we've learned? (Type 'yes' to continue)"},
      {"type": "auto_summary", "text": "Perfect! I'm creating a summary of your child's racial identity reflections for teachers."}
    ]
  }
] 