[
  {
    "module": "Interest Awareness",
    "steps": [
      {"type": "question", "text": "What are 2 or 3 things your child loves doing all the time, even when no one tells them to?"},
      {"type": "question", "text": "What are 2 or 3 careers your child has said they want to do one day?"},
      {"type": "question", "text": "Has your child started liking any new hobbies or activities recently?"},
      {"type": "auto_summary", "text": "Great! I'm generating a summary of your child's interests to share with teachers."}
    ]
  },
  {
    "module": "Racial Identity",
    "steps": [
      {"type": "question", "text": "What are 2 or 3 feelings your child has when they think about being Black? (Good or hard feelings are okay.)"},
      {"type": "question", "text": "Can you name 2 or 3 traditions or cultural things your child connects with being Black?"},
      {"type": "question", "text": "Who are 2 or 3 Black people your child looks up to or feels inspired by?"},
      {"type": "auto_summary", "text": "Perfect! I'm creating a summary of your child's racial identity reflections for teachers."}
    ]
  },
  {
    "module": "Can-Do-Attitude",
    "steps": [
      {"type": "question", "text": "What are 1-3 ways your child defines success?"},
      {"type": "question", "text": "What makes a space feel good for your child to focus or be creative in?"},
      {"type": "question", "text": "How can you tell when your child needs help?"},
      {"type": "question", "text": "What are some ways your child pushes through challenges in things they care about?"},
      {"type": "auto_summary", "text": "Excellent! I'm summarizing your child's can-do attitude and resilience for teachers."}
    ]
  },
  {
    "module": "Multicultural Navigation",
    "steps": [
      {"type": "question", "text": "How is your child's behavior or personality different at home compared to school?"},
      {"type": "question", "text": "What does your child usually do when they're somewhere new or unfamiliar?"},
      {"type": "auto_summary", "text": "Wonderful! I'm creating a summary about how your child navigates different cultures and environments."}
    ]
  },
  {
    "module": "Selective Trust",
    "steps": [
      {"type": "question", "text": "What are 1-3 things you've taught your child to notice when deciding who to trust?"},
      {"type": "question", "text": "What are some ways a teacher or mentor can earn your child's trust?"},
      {"type": "auto_summary", "text": "Great insights! I'm summarizing how your child builds trust and what teachers should know."}
    ]
  },
  {
    "module": "Social Justice / Fairness",
    "steps": [
      {"type": "question", "text": "What are some causes or community issues your child really cares about?"},
      {"type": "auto_summary", "text": "Amazing! I'm creating a final comprehensive summary that puts everything together for teachers and others."}
    ]
  }
] 